; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-7-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-8 - location
	p1-4 - location
	p1-11 - location
	p3-2 - location
	p3-11 - location
	p4-6 - location
	p4-10 - location
	p5-4 - location
	p6-1 - location
	p7-1 - location
	p7-9 - location
	p8-1 - location
	p8-5 - location
	p9-0 - location
	p9-1 - location
	p9-3 - location
	p10-6 - location
	p10-7 - location
	p10-8 - location
	p11-4 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s2)
	(at driver3 s8)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s8)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s5)
	(at package2 s5)
	(at package3 s11)
	(at package4 s1)
	(at package5 s6)
	(at package6 s10)
	(at package7 s9)
	(at package8 s3)
	(at package9 s10)
	(at package10 s0)
	(at package11 s6)
	(at package12 s3)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(= (time-to-walk s0 p0-8) 34)
	(= (time-to-walk p0-8 s0) 34)
	(= (time-to-walk s8 p0-8) 51)
	(= (time-to-walk p0-8 s8) 51)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 77)
	(= (time-to-walk p1-4 s1) 77)
	(= (time-to-walk s4 p1-4) 33)
	(= (time-to-walk p1-4 s4) 33)
	(path s1 p1-11)
	(path p1-11 s1)
	(path s11 p1-11)
	(path p1-11 s11)
	(= (time-to-walk s1 p1-11) 62)
	(= (time-to-walk p1-11 s1) 62)
	(= (time-to-walk s11 p1-11) 55)
	(= (time-to-walk p1-11 s11) 55)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 22)
	(= (time-to-walk p3-2 s3) 22)
	(= (time-to-walk s2 p3-2) 20)
	(= (time-to-walk p3-2 s2) 20)
	(path s3 p3-11)
	(path p3-11 s3)
	(path s11 p3-11)
	(path p3-11 s11)
	(= (time-to-walk s3 p3-11) 85)
	(= (time-to-walk p3-11 s3) 85)
	(= (time-to-walk s11 p3-11) 52)
	(= (time-to-walk p3-11 s11) 52)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 6)
	(= (time-to-walk p4-6 s4) 6)
	(= (time-to-walk s6 p4-6) 36)
	(= (time-to-walk p4-6 s6) 36)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(= (time-to-walk s4 p4-10) 43)
	(= (time-to-walk p4-10 s4) 43)
	(= (time-to-walk s10 p4-10) 84)
	(= (time-to-walk p4-10 s10) 84)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 89)
	(= (time-to-walk p5-4 s5) 89)
	(= (time-to-walk s4 p5-4) 46)
	(= (time-to-walk p5-4 s4) 46)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 10)
	(= (time-to-walk p6-1 s6) 10)
	(= (time-to-walk s1 p6-1) 12)
	(= (time-to-walk p6-1 s1) 12)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 75)
	(= (time-to-walk p7-1 s7) 75)
	(= (time-to-walk s1 p7-1) 98)
	(= (time-to-walk p7-1 s1) 98)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 53)
	(= (time-to-walk p7-9 s7) 53)
	(= (time-to-walk s9 p7-9) 24)
	(= (time-to-walk p7-9 s9) 24)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 2)
	(= (time-to-walk p8-1 s8) 2)
	(= (time-to-walk s1 p8-1) 12)
	(= (time-to-walk p8-1 s1) 12)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 81)
	(= (time-to-walk p8-5 s8) 81)
	(= (time-to-walk s5 p8-5) 54)
	(= (time-to-walk p8-5 s5) 54)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(= (time-to-walk s9 p9-0) 21)
	(= (time-to-walk p9-0 s9) 21)
	(= (time-to-walk s0 p9-0) 8)
	(= (time-to-walk p9-0 s0) 8)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(= (time-to-walk s9 p9-1) 82)
	(= (time-to-walk p9-1 s9) 82)
	(= (time-to-walk s1 p9-1) 75)
	(= (time-to-walk p9-1 s1) 75)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 23)
	(= (time-to-walk p9-3 s9) 23)
	(= (time-to-walk s3 p9-3) 15)
	(= (time-to-walk p9-3 s3) 15)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(= (time-to-walk s10 p10-6) 26)
	(= (time-to-walk p10-6 s10) 26)
	(= (time-to-walk s6 p10-6) 99)
	(= (time-to-walk p10-6 s6) 99)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(= (time-to-walk s10 p10-7) 48)
	(= (time-to-walk p10-7 s10) 48)
	(= (time-to-walk s7 p10-7) 87)
	(= (time-to-walk p10-7 s7) 87)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(= (time-to-walk s10 p10-8) 54)
	(= (time-to-walk p10-8 s10) 54)
	(= (time-to-walk s8 p10-8) 69)
	(= (time-to-walk p10-8 s8) 69)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(= (time-to-walk s11 p11-4) 6)
	(= (time-to-walk p11-4 s11) 6)
	(= (time-to-walk s4 p11-4) 38)
	(= (time-to-walk p11-4 s4) 38)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 20)
	(= (time-to-drive s7 s0) 20)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 12)
	(= (time-to-drive s10 s0) 12)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 74)
	(= (time-to-drive s11 s0) 74)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 62)
	(= (time-to-drive s3 s1) 62)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 95)
	(= (time-to-drive s6 s1) 95)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 63)
	(= (time-to-drive s9 s1) 63)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 7)
	(= (time-to-drive s4 s3) 7)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 4)
	(= (time-to-drive s6 s3) 4)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 75)
	(= (time-to-drive s8 s3) 75)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 82)
	(= (time-to-drive s9 s3) 82)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 2)
	(= (time-to-drive s5 s4) 2)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 27)
	(= (time-to-drive s9 s4) 27)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 5)
	(= (time-to-drive s1 s5) 5)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 4)
	(= (time-to-drive s6 s5) 4)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 39)
	(= (time-to-drive s8 s5) 39)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 86)
	(= (time-to-drive s11 s5) 86)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 57)
	(= (time-to-drive s0 s6) 57)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 59)
	(= (time-to-drive s9 s6) 59)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 94)
	(= (time-to-drive s11 s6) 94)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 38)
	(= (time-to-drive s9 s7) 38)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 34)
	(= (time-to-drive s11 s7) 34)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 16)
	(= (time-to-drive s0 s8) 16)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 52)
	(= (time-to-drive s1 s8) 52)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 59)
	(= (time-to-drive s2 s8) 59)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 14)
	(= (time-to-drive s6 s8) 14)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 99)
	(= (time-to-drive s7 s8) 99)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 46)
	(= (time-to-drive s9 s8) 46)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 67)
	(= (time-to-drive s10 s8) 67)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 68)
	(= (time-to-drive s0 s9) 68)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 51)
	(= (time-to-drive s2 s10) 51)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 5)
	(= (time-to-drive s7 s10) 5)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 87)
	(= (time-to-drive s9 s11) 87)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 62)
	(= (time-to-drive s10 s11) 62)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s3)
	(at truck1 s10)
	(at truck3 s7)
	(at truck4 s1)
	(at truck5 s3)
	(at truck7 s0)
	(at package1 s8)
	(at package2 s10)
	(at package3 s7)
	(at package4 s9)
	(at package5 s3)
	(at package6 s6)
	(at package8 s2)
	(at package9 s4)
	(at package10 s7)
	(at package11 s1)
	(at package12 s6)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver3 truck5 s8)
   deleted: (at driver3 s8) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 0 of 18
2. (drive-truck truck5 s8 s0 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   changed: (driven) from 0 to 16
   goals met: 0 of 18
3. (load-truck package10 truck5 s0)
   deleted: (at package10 s0)
   added: (in package10 truck5)
   goals met: 0 of 18
4. (drive-truck truck5 s0 s10 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s10)
   changed: (driven) from 16 to 28
   goals met: 0 of 18
5. (load-truck package6 truck5 s10)
   deleted: (at package6 s10)
   added: (in package6 truck5)
   goals met: 0 of 18
6. (load-truck package9 truck5 s10)
   deleted: (at package9 s10)
   added: (in package9 truck5)
   goals met: 0 of 18
7. (drive-truck truck5 s10 s0 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s0)
   changed: (driven) from 28 to 40
   goals met: 0 of 18
8. (board-truck driver2 truck7 s2)
   deleted: (at driver2 s2) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 0 of 18
9. (drive-truck truck5 s0 s11 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s11)
   changed: (driven) from 40 to 114
   goals met: 0 of 18
10. (load-truck package3 truck5 s11)
   deleted: (at package3 s11)
   added: (in package3 truck5)
   goals met: 0 of 18
11. (drive-truck truck5 s11 s0 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s0)
   changed: (driven) from 114 to 188
   goals met: 0 of 18
12. (disembark-truck driver2 truck7 s2)
   deleted: (driving driver2 truck7)
   added: (at driver2 s2) (empty truck7)
   goals met: 0 of 18
13. (drive-truck truck5 s0 s6 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   changed: (driven) from 188 to 245
   goals met: 0 of 18
14. (load-truck package11 truck5 s6)
   deleted: (at package11 s6)
   added: (in package11 truck5)
   goals met: 0 of 18
15. (drive-truck truck5 s6 s0 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   changed: (driven) from 245 to 302
   goals met: 0 of 18
16. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 0 of 18
17. (drive-truck truck5 s0 s7 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s7)
   changed: (driven) from 302 to 322
   goals met: 0 of 18
18. (unload-truck package10 truck5 s7)
   deleted: (in package10 truck5)
   added: (at package10 s7)
   goals met: 1 of 18
19. (drive-truck truck5 s7 s11 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s11)
   changed: (driven) from 322 to 356
   goals met: 1 of 18
20. (drive-truck truck5 s11 s6 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s6)
   changed: (driven) from 356 to 450
   goals met: 1 of 18
21. (load-truck package5 truck5 s6)
   deleted: (at package5 s6)
   added: (in package5 truck5)
   goals met: 1 of 18
22. (drive-truck truck5 s6 s0 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   changed: (driven) from 450 to 507
   goals met: 1 of 18
23. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 1 of 18
24. (drive-truck truck5 s0 s7 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s7)
   changed: (driven) from 507 to 527
   goals met: 1 of 18
25. (unload-truck package3 truck5 s7)
   deleted: (in package3 truck5)
   added: (at package3 s7)
   goals met: 2 of 18
26. (drive-truck truck5 s7 s0 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s0)
   changed: (driven) from 527 to 547
   goals met: 2 of 18
27. (walk driver2 s2 p3-2)
   deleted: (at driver2 s2)
   added: (at driver2 p3-2)
   changed: (walked) from 0 to 20
   goals met: 2 of 18
28. (drive-truck truck5 s0 s6 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   changed: (driven) from 547 to 604
   goals met: 2 of 18
29. (unload-truck package6 truck5 s6)
   deleted: (in package6 truck5)
   added: (at package6 s6)
   goals met: 3 of 18
30. (walk driver2 p3-2 s3)
   deleted: (at driver2 p3-2)
   added: (at driver2 s3)
   changed: (walked) from 20 to 42
   goals met: 4 of 18
31. (walk driver1 s7 p7-9)
   deleted: (at driver1 s7)
   added: (at driver1 p7-9)
   changed: (walked) from 42 to 95
   goals met: 4 of 18
32. (drive-truck truck5 s6 s1 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s1)
   changed: (driven) from 604 to 699
   goals met: 4 of 18
33. (walk driver2 s3 p3-2)
   deleted: (at driver2 s3)
   added: (at driver2 p3-2)
   changed: (walked) from 95 to 117
   goals met: 3 of 18
34. (unload-truck package11 truck5 s1)
   deleted: (in package11 truck5)
   added: (at package11 s1)
   goals met: 4 of 18
35. (load-truck package4 truck5 s1)
   deleted: (at package4 s1)
   added: (in package4 truck5)
   goals met: 4 of 18
36. (drive-truck truck5 s1 s8 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s8)
   changed: (driven) from 699 to 751
   goals met: 4 of 18
37. (drive-truck truck5 s8 s0 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   changed: (driven) from 751 to 767
   goals met: 4 of 18
38. (walk driver1 p7-9 s9)
   deleted: (at driver1 p7-9)
   added: (at driver1 s9)
   changed: (walked) from 117 to 141
   goals met: 4 of 18
39. (walk driver1 s9 p9-3)
   deleted: (at driver1 s9)
   added: (at driver1 p9-3)
   changed: (walked) from 141 to 164
   goals met: 4 of 18
40. (drive-truck truck5 s0 s9 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s9)
   changed: (driven) from 767 to 835
   goals met: 4 of 18
41. (unload-truck package4 truck5 s9)
   deleted: (in package4 truck5)
   added: (at package4 s9)
   goals met: 5 of 18
42. (drive-truck truck5 s9 s0 driver3)
   deleted: (at truck5 s9)
   added: (at truck5 s0)
   changed: (driven) from 835 to 903
   goals met: 5 of 18
43. (walk driver1 p9-3 s3)
   deleted: (at driver1 p9-3)
   added: (at driver1 s3)
   changed: (walked) from 164 to 179
   goals met: 6 of 18
44. (walk driver2 p3-2 s2)
   deleted: (at driver2 p3-2)
   added: (at driver2 s2)
   changed: (walked) from 179 to 199
   goals met: 6 of 18
45. (drive-truck truck5 s0 s8 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s8)
   changed: (driven) from 903 to 919
   goals met: 6 of 18
46. (board-truck driver2 truck7 s2)
   deleted: (at driver2 s2) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 6 of 18
47. (drive-truck truck7 s2 s10 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s10)
   changed: (driven) from 919 to 970
   goals met: 6 of 18
48. (drive-truck truck5 s8 s5 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s5)
   changed: (driven) from 970 to 1009
   goals met: 6 of 18
49. (load-truck package2 truck5 s5)
   deleted: (at package2 s5)
   added: (in package2 truck5)
   goals met: 6 of 18
50. (drive-truck truck7 s10 s0 driver2)
   deleted: (at truck7 s10)
   added: (at truck7 s0)
   changed: (driven) from 1009 to 1021
   goals met: 7 of 18
51. (walk driver1 s3 p3-2)
   deleted: (at driver1 s3)
   added: (at driver1 p3-2)
   changed: (walked) from 199 to 221
   goals met: 6 of 18
52. (load-truck package1 truck5 s5)
   deleted: (at package1 s5)
   added: (in package1 truck5)
   goals met: 6 of 18
53. (disembark-truck driver2 truck7 s0)
   deleted: (driving driver2 truck7)
   added: (at driver2 s0) (empty truck7)
   goals met: 6 of 18
54. (drive-truck truck5 s5 s1 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   changed: (driven) from 1021 to 1026
   goals met: 6 of 18
55. (drive-truck truck5 s1 s3 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s3)
   changed: (driven) from 1026 to 1088
   goals met: 7 of 18
56. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 7 of 18
57. (unload-truck package5 truck5 s3)
   deleted: (in package5 truck5)
   added: (at package5 s3)
   goals met: 8 of 18
58. (load-truck package8 truck5 s3)
   deleted: (at package8 s3)
   added: (in package8 truck5)
   goals met: 8 of 18
59. (load-truck package12 truck5 s3)
   deleted: (at package12 s3)
   added: (in package12 truck5)
   goals met: 8 of 18
60. (walk driver1 p3-2 s2)
   deleted: (at driver1 p3-2)
   added: (at driver1 s2)
   changed: (walked) from 221 to 241
   goals met: 8 of 18
61. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 8 of 18
62. (drive-truck truck3 s2 s8 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   changed: (driven) from 1088 to 1147
   goals met: 8 of 18
63. (drive-truck truck4 s0 s9 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s9)
   changed: (driven) from 1147 to 1215
   goals met: 8 of 18
64. (drive-truck truck3 s8 s7 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s7)
   changed: (driven) from 1215 to 1314
   goals met: 9 of 18
65. (drive-truck truck4 s9 s3 driver2)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (driven) from 1314 to 1396
   goals met: 9 of 18
66. (drive-truck truck5 s3 s8 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s8)
   changed: (driven) from 1396 to 1471
   goals met: 8 of 18
67. (unload-truck package1 truck5 s8)
   deleted: (in package1 truck5)
   added: (at package1 s8)
   goals met: 9 of 18
68. (drive-truck truck4 s3 s1 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (driven) from 1471 to 1533
   goals met: 10 of 18
69. (drive-truck truck5 s8 s2 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s2)
   changed: (driven) from 1533 to 1592
   goals met: 10 of 18
70. (unload-truck package8 truck5 s2)
   deleted: (in package8 truck5)
   added: (at package8 s2)
   goals met: 11 of 18
71. (drive-truck truck5 s2 s8 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s8)
   changed: (driven) from 1592 to 1651
   goals met: 11 of 18
72. (drive-truck truck3 s7 s9 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   changed: (driven) from 1651 to 1689
   goals met: 10 of 18
73. (drive-truck truck5 s8 s6 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s6)
   changed: (driven) from 1689 to 1703
   goals met: 10 of 18
74. (unload-truck package12 truck5 s6)
   deleted: (in package12 truck5)
   added: (at package12 s6)
   goals met: 11 of 18
75. (drive-truck truck5 s6 s8 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s8)
   changed: (driven) from 1703 to 1717
   goals met: 11 of 18
76. (drive-truck truck5 s8 s10 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s10)
   changed: (driven) from 1717 to 1784
   goals met: 11 of 18
77. (unload-truck package2 truck5 s10)
   deleted: (in package2 truck5)
   added: (at package2 s10)
   goals met: 12 of 18
78. (drive-truck truck5 s10 s8 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s8)
   changed: (driven) from 1784 to 1851
   goals met: 12 of 18
79. (drive-truck truck5 s8 s3 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s3)
   changed: (driven) from 1851 to 1926
   goals met: 13 of 18
80. (drive-truck truck3 s9 s8 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (driven) from 1926 to 1972
   goals met: 13 of 18
81. (drive-truck truck5 s3 s4 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   changed: (driven) from 1972 to 1979
   goals met: 12 of 18
82. (unload-truck package9 truck5 s4)
   deleted: (in package9 truck5)
   added: (at package9 s4)
   goals met: 13 of 18
83. (drive-truck truck5 s4 s3 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (driven) from 1979 to 1986
   goals met: 14 of 18
84. (drive-truck truck4 s1 s3 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (driven) from 1986 to 2048
   goals met: 13 of 18
85. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 14 of 18
86. (drive-truck truck3 s8 s7 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s7)
   changed: (driven) from 2048 to 2147
   goals met: 15 of 18
87. (walk driver2 s3 p3-2)
   deleted: (at driver2 s3)
   added: (at driver2 p3-2)
   changed: (walked) from 241 to 263
   goals met: 14 of 18
88. (walk driver2 p3-2 s2)
   deleted: (at driver2 p3-2)
   added: (at driver2 s2)
   changed: (walked) from 263 to 283
   goals met: 14 of 18
89. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 14 of 18
90. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 14 of 18
91. (drive-truck truck4 s3 s1 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (driven) from 2147 to 2209
   goals met: 15 of 18
92. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 15 of 18
93. (drive-truck truck1 s2 s10 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s10)
   changed: (driven) from 2209 to 2260
   goals met: 16 of 18
94. (disembark-truck driver1 truck3 s7)
   deleted: (driving driver1 truck3)
   added: (at driver1 s7) (empty truck3)
   goals met: 16 of 18
95. (drive-truck truck1 s10 s8 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s8)
   changed: (driven) from 2260 to 2327
   goals met: 15 of 18
96. (drive-truck truck1 s8 s3 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   changed: (driven) from 2327 to 2402
   goals met: 15 of 18
97. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 16 of 18
98. (walk driver1 s7 p7-9)
   deleted: (at driver1 s7)
   added: (at driver1 p7-9)
   changed: (walked) from 283 to 336
   goals met: 16 of 18
99. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 15 of 18
100. (drive-truck truck1 s3 s8 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   changed: (driven) from 2402 to 2477
   goals met: 15 of 18
101. (drive-truck truck1 s8 s10 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s10)
   changed: (driven) from 2477 to 2544
   goals met: 16 of 18
102. (disembark-truck driver2 truck1 s10)
   deleted: (driving driver2 truck1)
   added: (at driver2 s10) (empty truck1)
   goals met: 16 of 18
103. (walk driver1 p7-9 s9)
   deleted: (at driver1 p7-9)
   added: (at driver1 s9)
   changed: (walked) from 336 to 360
   goals met: 16 of 18
104. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 16 of 18
105. (walk driver1 s9 p9-3)
   deleted: (at driver1 s9)
   added: (at driver1 p9-3)
   changed: (walked) from 360 to 383
   goals met: 16 of 18
106. (walk driver1 p9-3 s3)
   deleted: (at driver1 p9-3)
   added: (at driver1 s3)
   changed: (walked) from 383 to 398
   goals met: 17 of 18
107. (walk driver2 s10 p10-6)
   deleted: (at driver2 s10)
   added: (at driver2 p10-6)
   changed: (walked) from 398 to 424
   goals met: 17 of 18
108. (walk driver2 p10-6 s6)
   deleted: (at driver2 p10-6)
   added: (at driver2 s6)
   changed: (walked) from 424 to 523
   goals met: 17 of 18
109. (board-truck driver2 truck2 s6)
   deleted: (at driver2 s6) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 17 of 18
110. (drive-truck truck2 s6 s3 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (driven) from 2544 to 2548
   goals met: 17 of 18
111. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 18 of 18
